-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- 主機： mysqldb
-- 產生時間： 2022 年 06 月 05 日 13:18
-- 伺服器版本： 10.5.8-MariaDB-1:10.5.8+maria~focal
-- PHP 版本： 8.0.18

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";

--
-- 資料庫: `mybook`
--

--
-- 傾印資料表的資料 `admins`
--

INSERT INTO `admins` (`id`, `acc`, `password`, `created_at`, `updated_at`) VALUES
(1, 'admin', '$2y$10$U1vCTMYAD2MWcNDlSW6ayelzgAKeyv5efIOTmUMAoOt7rbwJfnu7m', '2022-05-19 02:44:40', '2022-05-24 03:33:42');

--
-- 傾印資料表的資料 `ads`
--

INSERT INTO `ads` (`id`, `text`, `sh`, `deleted_at`, `created_at`, `updated_at`) VALUES
(1, '測試廣告111', 1, '2022-05-18 02:51:19', '2022-05-18 02:46:50', '2022-05-18 02:51:19'),
(2, '測試一二三', 1, '2022-05-23 03:02:31', '2022-05-18 02:51:30', '2022-05-23 03:02:31'),
(3, '轉知臺北教育大學與臺灣師大合辦第11屆廣研', 1, NULL, '2022-05-23 03:03:22', '2022-05-23 03:03:22'),
(4, '轉知：法務部辦理', 1, NULL, '2022-05-23 03:03:44', '2022-05-23 03:03:44'),
(5, '轉知：2012年全國青年水墨創作大賽活動', 1, NULL, '2022-05-23 03:04:06', '2022-05-23 03:04:06'),
(6, '欣榮圖書館101年悅讀達人', 1, NULL, '2022-05-23 03:04:33', '2022-05-23 03:04:33');

--
-- 傾印資料表的資料 `bottoms`
--

INSERT INTO `bottoms` (`id`, `bottom`, `created_at`, `updated_at`) VALUES
(1, '2020 科技大學版權所有', '2022-05-18 03:50:00', '2022-05-18 07:09:02');

--
-- 傾印資料表的資料 `images`
--

INSERT INTO `images` (`id`, `img`, `sh`, `created_at`, `updated_at`) VALUES
(2, '01D01.jpg', 1, '2022-05-18 07:31:03', '2022-05-18 07:33:18'),
(3, '01D02.jpg', 1, '2022-05-18 07:31:09', '2022-05-18 07:31:09'),
(4, '01D03.jpg', 1, '2022-05-18 07:31:15', '2022-05-18 07:31:15'),
(5, '01D04.jpg', 1, '2022-05-18 07:31:19', '2022-05-18 07:31:19'),
(6, '01D06.jpg', 1, '2022-05-18 07:33:44', '2022-05-18 07:33:52');

--
-- 傾印資料表的資料 `menus`
--

INSERT INTO `menus` (`id`, `text`, `href`, `sh`, `created_at`, `updated_at`) VALUES
(1, '網站首頁', '/', 1, '2022-05-19 02:59:09', '2022-05-19 02:59:52'),
(3, '管理登入', '/login', 1, '2022-05-23 02:19:34', '2022-05-23 02:19:34');

--
-- 傾印資料表的資料 `mvims`
--

INSERT INTO `mvims` (`id`, `img`, `sh`, `created_at`, `updated_at`) VALUES
(1, '01C02.gif', 1, '2022-05-19 01:34:05', '2022-05-19 01:34:08'),
(2, '01C03.gif', 1, '2022-05-19 01:34:15', '2022-05-19 01:34:15'),
(4, '01C01.gif', 1, '2022-05-19 02:11:37', '2022-05-19 02:11:37'),
(6, '01C05.gif', 1, '2022-05-19 03:37:27', '2022-05-19 03:39:56'),
(7, '01C06.gif', 1, '2022-05-19 03:37:34', '2022-05-19 03:39:56');

--
-- 傾印資料表的資料 `news`
--

INSERT INTO `news` (`id`, `text`, `sh`, `created_at`, `updated_at`) VALUES
(1, '微軟開始測試跨Windows、Web平臺的One Outlook用戶端軟體', 1, '2022-05-19 01:52:18', '2022-05-23 03:30:28'),
(2, '英特爾修補10多項晶片韌體高風險漏洞', 1, '2022-05-19 01:52:24', '2022-05-23 03:30:29'),
(3, 'aaaa123123123\r\n\r\n12313', 1, '2022-05-19 02:55:44', '2022-05-23 03:30:29'),
(4, 'sdfaqw3e12\r\n123\r\n12\r\n3\r\n123', 1, '2022-05-23 03:28:38', '2022-05-23 03:33:04'),
(5, '12312asdf\r\nasdf\r\nasd\r\nf', 1, '2022-05-23 03:28:56', '2022-05-23 03:33:10'),
(6, 'sdf2rlu23045u2305tj3pn\r\noiegjidsjg\r\ndgdsiopbjsdiopbn', 1, '2022-05-23 03:32:44', '2022-05-23 03:33:10');

--
-- 傾印資料表的資料 `sub_menus`
--

INSERT INTO `sub_menus` (`id`, `text`, `href`, `menu_id`, `created_at`, `updated_at`) VALUES
(1, '更多消息', '/news', 1, '2022-05-19 05:22:17', '2022-05-23 02:20:48'),
(3, '每日最新', '/todaynews', 2, '2022-05-19 06:11:16', '2022-05-19 06:19:39'),
(4, '全部新聞', '/allnews', 2, '2022-05-19 06:11:31', '2022-05-19 06:11:31');

--
-- 傾印資料表的資料 `titles`
--

INSERT INTO `titles` (`id`, `text`, `img`, `sh`, `deleted_at`, `created_at`, `updated_at`) VALUES
(2, '科技大學校園資訊系統', '01B01.jpg', 1, '2022-05-16 05:06:42', '2022-05-16 02:54:31', '2022-05-16 05:06:42'),
(3, '科技大學校園資訊系統', '01B02.jpg', 1, NULL, '2022-05-16 02:54:31', '2022-05-20 02:22:32'),
(4, '測試大學', '01B01.jpg', 0, '2022-05-17 08:20:44', '2022-05-16 07:42:57', '2022-05-17 08:20:44'),
(5, '台北大學', '01B03.jpg', 0, NULL, '2022-05-16 07:44:56', '2022-05-20 02:22:31'),
(6, '台中大學', '01B04.jpg', 0, NULL, '2022-05-16 07:47:32', '2022-05-20 02:22:32'),
(7, '卓越科技大學', '01B01.jpg', 0, NULL, '2022-05-17 03:25:32', '2022-05-20 02:18:30');

--
-- 傾印資料表的資料 `totals`
--

INSERT INTO `totals` (`id`, `total`, `created_at`, `updated_at`) VALUES
(1, 152, '2022-05-18 03:50:00', '2022-06-05 12:52:26');
COMMIT;

